{"title":"AITA. I drove into this backwoods neighborhood on accident and apparently made some people suspicious.","selftext":"I don't know if this is the best place to post this but this whole situation had me feeling some kind of way. \n\nI was on my way to a party and I plugged in the address but I think something was off because I wasn't at the right house (which I would find later).\n\nFor some information, I'm a black man with dreadlocks and I was deep in the country in south Alabama. I drove to a dead end in like a trailer park out in the country. There was a man standing at the end of the road just staring at me and there was someone behind me. There wasn't much room in this cul-de-sac. I tried backing up and turning around (I figured this wasn't the right place) but the guy behind me was kinda in the way. \n\nAnyways, the guy in the car behind me (an older white man) got out and knocked on my window and he said something like \"are you looking for something/whats going on?\" it was kinda hard to understand him. It kinda sound like he had tobacco in his mouth. \n\nI just told him I had an address and I was looking for a friend. Then he asked me \"don't you live right over there?\" pointing at a trailer like right across from him. I told him I didn't live around there and I was just looking for my friend at an address they gave me. \nHe said \"alright you can backout over here.\" \n\nI backed out, left, and eventually found the party, but something about that interaction felt kinda awkward/threatening. Am I overreacting? Did I do something to warrant that guy waking up to my car like that and questioning me?"}
{"title":"WIBTA if I quit over another co-worker being promoted?","selftext":"I work at a fast food place. I'm currently a cashier, but I've been training (mostly just cooking, haven't started doing most of the non-cooking jobs yet) to be a cook for a few weeks now and my manager has said several times I'm going to get the position.\n\nI am one of the newest people at work and I've been there for around 5 months now. I turned 18 a little over a month ago and am now able to work many more hours.\n\nMy co-worker, \"Jane\" is the assistant manager's daughter and she has been there for over a year. Apparently she tried once a while back ago (not quite sure how long ago), but she could not prepare food quickly enough and remained as a cashier. I have heard this both from another co-worker and again from her.\n\n\"Jane\" has become much more interested in cooking as well ever since I started. Everyone is very close where I work and I am a little worried that due to a number of reasons (assistant manager's daughter, worked at location longer), I will be pushed to the side for this promotion in favor of her.\n\nObviously since I've been told I will eventually get the position and I've been training for it, I'm really excited for it and I would definitely be upset if that suddenly changed. I know it's kind of silly and childish, but I'm a senior in highschool and I figure another minimum wage job won't be too difficult and it would probably be better to work somewhere where people have less familial ties (there are a lot of people who are related + good family friends with one another here). Not to mention, I would only be a cashier and I doubt finding a replacement would be too difficult.\n\nWIBTA if I quit over her receiving the position? (To my knowledge, she has not yet asked for it from either her mother or the manager, so nothing might actually come out of it, but I was still interested in what others thought)."}
{"title":"AITA for buying 15 items worth $30 but miss-priced at $3 at Walmart","selftext":"So there’s this magic the gathering board game that comes with a ton of stuff and weighs probably 5-6 pounds. I went to self checkout at Walmart and it was priced at $3 when it said $30 on the shelf. Because it was self checkout and no worker would realize what I was doing, I went and bought the other 9 and asked the staff if they had any in stock. Sure enough, the staff brought out 5 more and I ended up spending $45 for $450 worth of stuff."}
{"title":"AITA for ignoring my brother's wishes for his funeral?","selftext":"My brother Clint recently lost his battle to cancer.  We're still reeling from this because he was still a pretty young guy and we all thought he was going to make it.  His funeral was last weekend.\n\nEver since he was a kid, Clint was a huge history buff, especially when it came to the American Civil War.  He had read every single book on the subject, he'd seen Glory, Gettysburg, and the Ken Burns documentary too many times to count, he's been to every major battlefield.  He took a job in the South so that he would be closer to some of these sites (we're originally from Nevada).  He even named his daughter after Clara Barton.  \n\nSeveral years back, Clint joined a reenactment group and was involved up until he was too sick to continue and moved back to Nevada to be with family.  By the time he left, his main role at these reenactments was as a captain on the Confederate side, with a uniform that he spent a lot of time researching and working towards to put together.  Not going to lie, but Clint was really damn proud of all that uniform.  \n\nClint wrote down in his will that he wanted to be buried in his captain's uniform with his Civil War stuff.  \n\nWe (me, our parents, and a few other relatives) didn't go through with it in the end because we didn't want to deal with other family members, friends, and everyone else giving us crap for burying Clint in a Confederate uniform.  And we didn't want others thinking Clint adopted alt-right, South will rise, ideas while living in the South.  This wasn't Clint at all because he used his role in the group to bring history alive and teach others about what life was like during a time period he was passionate about.  \n\nSo we buried him in a suit, with his uniform wrapped in a bundle and placed in his coffin with some of his other props. \n\nWell, several of his  friends came out for the funeral and were pissed that there were hardly anything from his reenactment days on display at the service.  We had a few props out like his replica musket, some of his favorite books, and a photograph of him from his early days in the group with a Union uniform he borrowed from a friend.  But it wasn't much to show.\n\nAs one of his friends put it, it was a disservice to Clint's memory that we barely had anything to display that showed off a part of his life that he was so passionate about, that he took great pride in, and formed a large part of his identity and glossed over his involvement in the group.  Even though I felt like we put out enough items to show that he loved learning and teaching about the Civil War.  \n\nOn the other hand, even if he didn't believe in those ideas, we didn't want paint a picture of Clint as a neo-Confederate for family and friends who didn't know him as well as we did and who would have been offended by seeing him with all his reenactment gear.  \n\nTL;DR: AITA because my family and I decided not to honor Clint's wishes and gloss over his role as a Confederate captain in a Civil War reenactment group?"}
{"title":"AITA For \"Forcing\" My Sister Who owes Me $2K To Hand Ober Illinois Avenue?","selftext":"EDIT: Hand Over!\n\nHere's the situation. My little sister (still A teenager) managed to live through most of her childhood without ever playing Monopoly by the rules. The real rules. No socialist free parking programs. Auctions for unwanted properties. The works. \n\nI wanted to go easy on her on her so I sunk a ton of money into hotels for Park Place and Boardwalk, expensive properties that no one ever lands on. Usually. Until my sister landed on one. \n\nSince we're playing with auctions we all own random smaterings of property. It just so happened my sister had the one property I wanted: Illinois Avenue. I told her I'd forego her massive payment if she gave me the property and gave me the money to u mortgage it. \n\nI shit you not My mostly-grown-ass-sister flipped the board over and screamed to our parents that I was being overly cruel. Everyone's on edge lately with what's going on in the world but I thought I was trying to be nice to her (it Was practically a 75% discount!). So was I the asshole??"}
{"title":"Aitah snigger means snicker (I’m black btw)","selftext":"Hey guys I have a question OK I do a podcast I’m not gonna put the name of the podcast because that’s not what I’m here for basically I was reading a story about a girl going on a scavenger hunt that her boyfriend made at the end of it he wrote a note in the fridge I said since you’re hereMake me food XOXO I was in doing her narrative and where she said where is the last note he said check the fridge he sniggered Yes I know what it sounds like but also put in mind I am black so I thought it was funny so I started saying what’s up my sniggers I mean my sniggas Because I found the irony in it I was going over in my car and a black dude sitting next to me got pissed off and said it was offensive I explain to the term of the word But then he got super pissed off am I the asshole?"}
{"title":"AITA for refusing to go back to college with my GF?","selftext":"So my spring break has just ended and I have been getting packed to head back to College tomorrow. I ran some errands in-between packing and noticed my check engine light was on.\n\nNormally this doesnt bother me too much, but I checked the codes and it turns out to be an issue that could be catastrophic if left unchecked. I decided that maybe I should take it in and go up to school after it is repaired (classes are all online at this point). \n\nI told my girlfriend that it might be better if I stay home and wait to drive up to our apartment (we live together) after my vehicle is fixed. She apparently thought this was a bad idea, and said that we can just ride in her car together back up to school. She expects my parents to drive the car back up to school for me once its repaired (it's a 2 hour drive so not too bad). \n\nI decided that I didnt want my parents to have to drove my car up for me. Instead, I am going to stay home until my car is fixed so I can drive it up. Shes very mad at me about this because she gets very scared by herself due to her anxiety. AITA?"}
{"title":"AITA for telling my husband I don’t want to get pregnant right now?","selftext":"My husband and I have both always wanted a big family with multiple kids. We have one beautiful son right now who is two years old. We had always said we wanted three kids, and then to possibly adopt or foster. \n\nWe struggled a bit getting pregnant and having healthy pregnancies (2 miscarriages) before my son. My son was a very rough pregnancy (sick daily, weekly nonstress tests, blood pressure issues, bed rest, etc). I was so relieved when he was born and healthy. \n\nWe started trying again and I have had two more miscarriages now. One was very early, one was right after the 12 week mark when we started to feel good. I had to have surgery for that miscarriage to remove the tissues. \n\nI am emotionally spent at this point with miscarriages. Each one weighs so heavy on my heart. My husband also struggles with this but his way of coping is to dust off and try again. We got into a big fight earlier this week about it and I told him I am not willing to try this month and possibly we should wait until later this year to try again. I need some time to just mentally heal and I’m not in a good place. He got very frustrated with me because we want multiple children and feels like we need to hurry if we want that to happen and can’t take time off. He says he doesn’t mean to pressure me but since I am the woman I am the one who has to go through with it. I told him maybe we should consider fostering or adopting a child who needs a home and he won’t even consider it, even though it’s something we said we’d do before.\n\nI understand this but am very stressed out and the idea of being pregnant again just to potentially lose it. Even the idea of having a successful pregnancy with all of the complications is just draining to me after the last few months. AITA for wanting to wait, even though we both early on said we want multiple kids?"}
{"title":"WIBTA for telling my bf I have a problem with his drinking.. idk if it’s excessive or if I’m just too much of a tightass","selftext":"My boyfriend and I have been dating for a short while, which seems like nothing but to put it into perspective, he’s the one. I would never leave him and it’s kinda just known we’re going to stay together. IYKYK. \n\nWe are long distance for the time being (we go to school in different states), but when this semester is done he’s coming home for good. We have amazing communication and rarely fight. If we have disagreements we talk it out calmly and respectfully. \n\nHe’s a student athlete but recently his season has been cancelled. He lives in a house with his best friends (5 guys) and I fully support him hanging out with them and having a good time and whatnot. \n\nBefore season started, he would drink one or a couple times a week, but he would say it’s just because they won’t get the chance once season starts. I just said okay and went along with it because he’s right and I wanted him to enjoy his time. \n\nNow I’m no prude - I enjoy a good drink from time to time. I don’t go out often but when I do I go hard. I don’t really see a point of just hanging out with friends and drinking just to drink on a regular basis. Not sure if I’m explaining that quite right but if y’all need any clarifications just ask me). \n\nSince season ended, he’s drank twice out of the past three days, which I understand. His life kinda just got flipped upside down, it was also his birthday, and now they have a few free days of spring break in Florida before going back home. I asked him if he would be drinking like that when he got back home. He said he would probably drink with the guys maybe once a week. \n\nHonestly, I’m not sure how I feel about that. I’m someone who’s not big on alcohol, weed, cigs, any of that. So for him to drink just to drink every week I think is a bit much. I mean you want to go out with your friends and drink once in a while then sure. Go nuts. But to do it every week?\n\nMaybe it’s a bro’s thing? Like just living in a house of guys maybe that’s just what you do? It’s also his last semester with his friends and he wants to enjoy his time as much as he can, which I’m super receptive to. I just don’t understand why he can’t have fun when he’s sober?\n\nI want to bring it up to him but I’m not totally sure what to say. I wouldn’t give him an ultimatum or anything, like I’m not gunna break up with him ever or anything. It just really irks me. \n\nSo, WIBTA for telling him how much this bothers me and trying to find a compromise? Or should I stop being selfish and just let him enjoy his last semester?\n\nEDIT: The drinking thing is temporary. He says when he comes home it won’t be like this. It’s just cause he’s living with all his friends and it’s his last semester. So it’s not a huge lifestyle incompatibility, I’m just not sure how to address it in the meantime"}
{"title":"AITA for being critical of my friend for having a younger boyfriend?","selftext":"/My best friend and I are both 22, but we've been best friends since high school. in December she started dating a guy she had met in one of her art classes who, after making official, I found out he was nineteen. It's only a three year difference but to me it seems like a leap in maturity. Anyone younger than 20 to me seem like babies. However, he is really nice, and they do have great chemistry together. I can tell they like each other by the way they look at each other.\n\nI have tried to ask her about the age difference but she says that three years isn't that big of a deal, especially since he's over eighteen. But he is also a pizza delivery driver who lives at home with his parents and doesn't pay any bills.\n\nMy only other gripe is since he's under 21, he can't go out to bars with us, so she's been hanging out with us less. Every so often we'll have a movie night where we'll drink a little or smoke and he'll sometimes have a beer or two, which makes me uncomfortable because I don't want to be caught around a minor in possession. She claims she won't buy alcohol or even cigarettes for him, but if she has a drink she doesn't care if he drinks some (in their defense, I've never seen him get too wasted, and I also do \"illegal\" things like smoking so it could be hypocritical)."}
{"title":"AITA for taking/hiding all my things from my roommate?","selftext":"Throwaway for many reasons \n\nSome background:\n\n   I (21f) have been living with my roommate (21f) for almost a year now. We have also been friends for about 10 years. The last 8 months have been great as we get along really well, we get along so well that even our parents are surprised lol. Well the last couple months have been rough. She often has come home with an attitude, she snaps at me for little things such as not putting dishes away even if I had just recently washed them, my bedroom door being closed (usually napping or doing homework), my laundry being in the dryer etc. I admit that these are simple things I could fix but she also does this from time to time and I don’t tend to say anything because 1. It’s normal stuff, it happens and 2. It’s not constant for either of us so it doesn’t bother me. \n   She also had an issue with me seeing my girlfriend every now and then whenever I have time, saying that I don’t make time for her and that I don’t take her feelings into consideration but the thing is I am home every single day, I work until 6 while also attending classes every day so whenever my girlfriend and I have the same days off we hang out, usually all day and sometimes all night. \n\nThe issue:\n\n   Anyways, since we are both girls we tend to share things such as clothing, makeup (highlighters, eyelash glue, blush, etc) which I don’t mind but recently I found out that when I’m not home and she tends to go into my room without my knowledge and will take my stuff. A lot of the times when I go out of town or stay at a friends or my girlfriends house, I’ll come home and MY stuff is missing and in her room. Now again, I don’t mind that she uses but I would like to know about it and have it returned in my room when i get home. I’ve told her this before and it continues to happen. It frustrates me especially because I ALWAYS ask to use her stuff because I was always taught to ask to use something or borrow something out of respect.\n   So, I started taking upon the actions of taking a lot of the makeup I use and wear with me (even if i don’t use it) or hiding it somewhere in my room when I leave town or stay somewhere. I know that she noticed I started doing this because a couple weeks ago she had asked me if I took my make up bag and I said yes, and then every time I’ve done it lately, I’ll come home and she has an attitude with me. I have just gotten tired of her taking things that are mine without my knowledge. \n   I told one of the friends i stay with because she had asked me why I had brought my whole makeup bag over one night and she had said that I was being over dramatic about the situation. So AITA?"}
{"title":"WIBTA if I went to my boss’ boss because of the way I’m being treated?","selftext":"I (25F) recently started at a new company under the assistant director, A, of a department. I am her first employee, but she started out in my position 4 years ago and worked her way up to where she is now. \n\nAt first things were great with A, but she slowly became very passive aggressive and micro managing. For example, everyone in my department works from home, except for me (because I’m the only one within driving distance of our office). I asked A one day if I could telecommute for ~3hr later that week to help watch someone’s cats while they tended to something important. Basically just involved me sitting on the couch and locking up when I left. She told me I have yet to earn the “perks” everyone else has and I should just take PTO to cover that time. I understood her point, but the way she said it was rather demeaning and rude. She will also call my office phone at random times just to see if I’m there, as opposed to secretly being online at home I guess? \n\nI’m awful with confrontation, and I don’t want to create any drama after just 2 months of working there, but I feel like A is taking certain things too far. I feel like she’s treating me way worse than the other members of our team that she does not directly oversee. So my question is, would I be the asshole if I went to her boss, M, about all of this? I work very closely with both of them, and M has always been very kind to me. I just want to be treated equally, but I know approaching A won’t do anything and I’m afraid addressing this with M will only make things worse."}
{"title":"AITA for agreeing to do things with a kid that shows up at my door everyday","selftext":"EDIT Sorry i forgot a word in the title\n\nRecently there has been a kid(ill call him h) that shows up at my door 2-3 times a day always asking if i want to go the park or something, well h makes me uncomfortable to be around as he has had anger issues and has a overall disturbing aura.\nI have a very social family thats says its very rude to turn him away over and over again.\nRecently this came to a climax where he came over and was saying how i had to hang out with him as he had already told his mum he could be at my house for a bit as  o\nNo one else was home, i told him i just didnt feel comfortable around him and he took offence and got a bit pissy. So i was wondering if there is a asshole here"}
{"title":"AITA for sharing a funny video containing the n-word?","selftext":"To start off, I'll give some context and then share the video. The video is only 19 seconds long, and no hard Rs are used. I've a Discord of friends I play World of Warcraft with, a MMORPG game. I'm rather comfortable with my friends, we get along well, and sometimes new friends join our group and our Discord. This conflict was with a relatively new addition to our friend group. Let's call him Jim.\n\nI was up late and I decided to browse my YouTube recommended when I happened upon this video [https://youtu.be/EPObWLXoCpE](https://youtu.be/EPObWLXoCpE) which tickled me. A sort of 'They had us in the first half, not gonna lie' type of video with a good ending. So, thinking this was a funny video, I shared this in our Discord group for others to view and enjoy, and I went back to watching YouTube since I thought no one would be up at 4 AM (we all live in similar timezones afaik).\n\nTo my surprise, I get a message from Jim, informing me that it's not really cool to put that in discord, that he gets it's a joke but that word makes him very uncomfortable. I have seen photos of Jim.Jim is a white-skinned, blonde young man. Just today, he shared with us a partial screenshot of his ancestry results in our Discord that showed him alongside a dark-skinned woman with gorgeous black kinky hair, predicting her to be his 5th-8th cousin.\n\nSomething in my lizard brain decides not to tuck tail and apologise. My lizard brain decides that this was a harmless joke and this fellow white man has some very strong feelings about the N-word, and is about to virtue signal me, educate me, and shame me.So my initial reply was:\n\n\"explain to me how is it not okay for me to share a funny video. I would get it if I was the one saying it\" (as in using the n-word myself) \"it's a joke, not even a hard r, and they bond over it\" (as in they end up in a friendly handshake and a clap on the back, no conflict or anger from either side)\n\nJim tells me that because this word has been used against his family for generations, and he finds it very unsettling to see it being used casually by someone in that sense. Jim tells me that he is not personally against me, and that he had a confrontation with another member of our friend group over using it, and that this isn't a hill worth dying on.\n\nStill not quite understanding, I simply reply with: \"I'm ... not even using it\"\n\n**Edit: accidentally pressed enter. Continuing.**\n\nJim asks me if I understand why it would make a man of carribean heritage uncomfortable.\n\nI say nope, especially not in this context. Now, more context. My boyfriend is half carribean. His mother was born in Nassau, Bahamas. She had beautiful olive skin before moving to England to marry and have three children. My boyfriend, let's call him Bob, used to be darker when he was a kid, too, but English weather and being inside all the time has drained his colour. He's still darker than me. Bob has no problem with the N-word. He does not care what context it is used in unless it is negative. I was afraid of it before, I was afraid of sharing videos of people saying it, sharing written Twitter jokes that had it, until he told me that \"being afraid of it gives the word power, and that power should be taken away from it.\" Mind you, I still don't use it. I never say it, I never write it.\n\nI filtered this information down to Jim, writing: \"My boyfriend is half carribean and he doesn't care about other people using it in a joking sense, i still don't use it around him but i'm used to being able to share videos containing \"the word\" for entertainment reasons, sorry that it upset you\"\n\nGranted, I could have chosen better language for my apology and said 'I'm sorry that -I- upset you,\" but oh well.\n\nJim tells me that \"I feel like you have a very base understanding of this as a white woman, but if this is the hill you want to die on then fine, lol, just count me out of this\"\n\nAnnoyed at this point, I tell him that he invited himself into this, and that I am sorry this cis white woman has a different opinion based on someone who shares his (Jim's) heritage.Jim tells me goodnight, and then sends me an article titled 'If you truly knew what the n-word meant to our ancestors, you would NEVER use it' and added: \"I think you'd do well reading this\"\n\nSo, Reddit. AITA? Should I go back and apologise and educate myself?"}
{"title":"AITA for telling my (25M) girlfriend (23F) she might as well turn her Fitstagram account into an OnlyFans?","selftext":"I know the title sounds bad but let me provide some context.\n\nMy girlfriend and I have been dating for almost three years. She has always been an attractive girl, but in the past year she started working out more and eating better and had an undeniable glow-up. Her body was always nice but now she's got a yoked back, a poppin' ass and abs like El Capitan. On top of that, her lifestyle adjustment has motivated me to do better for myself because I hate having a girlfriend who can squat more than me, so it's a win-win for the both of us.\n\nThere's just one issue. Within the past 6 months or so she has gotten real into the whole \"Fitstagram\" life. She's constantly posting videos of herself squatting and doing rows and leg lifts. I don't mind it in theory but the thing is she's always looking hot as fuck in these videos and she's always wearing leggings that show off her ass.\n\nShe's already amassed almost 10,000 followers. Dudes regularly slide into her DMs or comment with fire or drooling emojis. She never responds and always shows me and laughs about it, but it makes me really uncomfortable because I know these guys are cracking stick to her videos.\n\nShe also has me take a lot of said videos when we go to the gym together which honestly makes me feel like a cuck and the other day I really lost my cool. I was taking a video of her squatting and I thought it looked great. She looked at my recording and asked if I could take it again with more focus on her butt. I asked her if she was serious and she said, \"Yeah, I want to show off my glutes.\"\n\nI stood up and gave her her phone back and was just like, \"I'm not doing that. You're not Jen Selter. This is a fucking Planet Fitness. If you want to show off your ass so bad why don't you just make an OnlyFans.\"\n\nShe actually didn't know what OnlyFans was so I had to explain it to her but when I did she ran into the locker room and refused to come out. She texted me telling me she would Uber home and that I should just leave. It's been two days and she's barely spoken to me and I'm starting to worry about those dudes in her DMs. \n\nI realize it probably wasn't wise of me to equate having a fitness account with being fucked on camera. I also realize that my freakout probably came as a shock to her because I've never expressed discomfort with her doing this before. But how could I? She was happy and motivated and I didn't want to rain on her parade so I just did my best to deal with it.\n\nStill, I don't understand how she couldn't see that watching thousands of people salivate over her body would be difficult for me, especially when some of them are beefy, bearded, broad-shouldered men. I feel like she shares the majority of the blame for being blind to my feelings, especially because I'm her main photographer and boyfriend and there's not a single mention or picture of me on her account. But then again maybe I'm just insecure. AITA?"}
{"title":"AITA for calling girls hoes as a joke?","selftext":"So this is a weird situation I’m in. Want to hear your input.\n\nSo I [16M] met a girl a few weeks ago, and we exchanged Instagram, numbers, snap, the usual. Let’s call this girl Lexie. Anyhow, she DMed me on Instagram today, saying she was just looking through some of my instragram pics and saw my instragram caption for one of them was calling girls hoes. \n\nThe backstory behind this pic is that it was taken at a holiday party at my friend’s house. I took a picture with three of my girl friends, and then as a joke/pun, put ‘hoe hoe hoe’ as the caption (like Santa saying ho ho ho). The friends were in on the joke and thought it was funny.\n\nAnyhow, I told Lexie this, but she said regardless of whether it’s a joke or not, it’s a ‘very disgusting thing to say’ and that she didn’t realize I was ‘misogynistic’. She then unfollowed me. I think she’s taking a joke out of context, and I don’t see anything I did as misogynistic at all.\n\nAita?"}
{"title":"AITA for telling my sister to stop having sex so loud at night.","selftext":"So my sister(17F) and I(15M) live at home with our mom and last night my sister had her boyfriend over and from my room across the hall from hers i can hear her having sex. I didnt say anything that night but this morning when we woke up and I was eating breakfast I said \"by the way you might want to keep it down at night I could hear you and Andrew fucking from across the hall.\" She just went off on me saying I'm being disrespectful for even bringing up to her and all of this bullshit. I was just trying to look out for her cuase if my mom was the one her heard them having sex her boyfriend wouldnt have a dick anymore."}
{"title":"AITA for being \"snappy\" with my mom?","selftext":"Ayoo, what's up. me again back with another story! So yeah, as the title says, me and my mother have been very distant these past three months, so, the whole year so far. and I think where it started is when i admitted that i wanted to try and live with my dad after he gets out of prison. Note the word *try.* I decided i should tell her after all the comments I got from my first story, which you can see on my profile i think. She seemed fine with it at first but after a couple more minutes she said that, even though things will seem like a dream at first, it'll get tiring. It took so hard for me to say, \"*Really?? I would've never* fucking *guessed!\"* but ya know, since i didn't want to have a red hand mark on my face i didn't. But I did say that i know, and that i said i wanted to try to live my dad for at least a year, or maybe even less, since i haven't gotten to live with him before. Mostly because she took that away from me. But I didn't say the last part. Read the red hand mark one again. She just shrugged and said fine. and i think things just went downhill from there. over the last two months she's just been so hard, she's just pressuring me over grades so much, it's like she doesn't even accept c's at this point. and i feel like she's just been piling chores and other things to do so much more than usual. All this piled with school work i have almost everyday its like i have no resting time. And if I do get some she finds something to nag me with. I've been getting my grades up, but it's like she doesn't care. I also haven't gone to my therapist in almost two months. So I've just been really agitated. Me and my mom have just been getting into more and more quarrels. and she's just taken everything but the computer i'm typing on (yet). i haven't been able to contact anybody for two months. All that just causes me to just be snippy with her. but she always makes me feel crappy at the end of all the arguments. like it's all my fault. and my stepdad isn't very helpful either, he just goes on with what she says, so that makes me feel even worse. she says that i have an attitude and that i'm just a spoiled brat, and she's just doing what she has to. but it's just so unfair to me. i've been doing everything she's wanted. i just want my phone at this point. she can take my books and computer away i just want to talk with my friends and other family.  I can't help but act like this with what's been going on. she's my mom and other people would say i should treat her better but i just... **cant**. so please, reddit, tell me, AITA? also should i put this somewhere else other than aita? i feel like it should"}
{"title":"WIBTA If I start distancing myself from my family member because she tattled on me to my mom.","selftext":"[WIBTA] If I start distancing myself from my family member because she tattled on me to my mom.\n\n[WIBTA] I am a young college student living at home who also happens to smoke weed frequently. My family member (anonymous for privacy) is in law enforcement and can detect signs of marijuana use apparently. She told on me and my friend to my mom and in a small little argument my mother and I had she brought up what that family member had mentioned to her haha. This makes my friend look bad and me. Mostly just worried about the impression on my friend though. It’s not the complete end of the world but it brings an unnecessary burden on my back now frequently. Why can’t the family member just mind their own business? Would I be the asshole if I started distancing myself from them? We’re fairly close, I mean not super but we were. Anyways I’d like to break ties with her and start distancing myself. I’d appreciate any judgments."}
{"title":"WIBTA if I prohibit sales of essential items on our Facebook yard sale page that are currently the target of price gouging?","selftext":"We’ve all heard and read the stories. People are cleaning out store shelves of essential items and reselling them online at exorbitant prices. I’m all for retail arbitrage, but at the same time, I cannot in good conscience let our neighborhood yard sale page be used as a tool for people who are clearly taking advantage of other’s current panic and fear by reselling things like toilet paper and hand sanitizer at ridiculously inflated prices. In this current situation, I feel that it’s wrong and I want no part in it."}
{"title":"AITA for being in a bad mood after my mother keeps disturbing my sleep?","selftext":"Recently I have had a lot of issues regarding my mental health. I mean I had a full on episode of severe depression and developed an eating disorder. I have been seeing a psychiatrist and she had given me a lot of help and support I have never had and has helped pull me out of that hole. One thing she recommended was to get sleep and to try and get into a routine with it, so I have been trying. Every night, bed at 10pm and up at 7am, sounds easy enough but sadly not. My mother has not gotten that memo. My mother has literally told me not to speak about my problems and to keep them to myself because she has her own problems. Yet she insists on doing things that only benefit her. I could make a large list that would even make Santa blush but I will stay on topic.\n\nOne thing she has been doing for the last 2 months is waking me up in the middle of the night, asking me if she could sleep in my bed with me then hopping in regardless of what I say becausemy father snores. Now this would not be a problem if it wasn't for the fact she takes up my entire bed, snores and hitting me in her sleep. I'm also one of those people who can't fall asleep easily if woken up so yes it is a nightmare. I like my space and don't want disturbed but my mother insists.\n\nLast night it happened again, mother comes in, ignores my response and ruins my sleep. So after laying there for 2 hours boiling with rage, I went to the living room and slept on the floor. I only got an hour and a half sleep when my mother comes in to start her day. Of course I'm in a really bad mood after she tells me off for sleeping on the floor so I tell her how she is ruining my sleep and have told her to stop but chooses to ignore me. She got angry and scolded me saying if i go to bed she will wake me up. When my father woke up, he sided with her and said i was inconsiderate and selfish and should change my attitude.\n\nI can still hear her bitching next door but personally I feel justified to be mad. AITA?\n\nEdit: I also pointed out that I am trying to do what the psychiatrist told me to help myself but she ignores it."}
{"title":"AITA for wanting my bf to come to the hospital with me for an asthma attack?","selftext":"I have asthma and have ended up in the hospital 3 times since we started dating last year. Twice was for asthma attacks, the other time I didn't get any answers for why I was throwing up and dizzy without a fever. \n\nI also asked him to come to the walk-in clinic with me twice over the last 4 months and he said he would but cancelled to play games with his friends.\n\nHe did come once after that.\n\nI should mention that I am 39 and he is 35. We are not young.\n\nHe said he couldn't come to the hospital last time because of waiting for IT to give them information about working from home. I understand the importance of work stuff. But he didn't come after work either. And we had plans to hangout all weekend but he cancelled and said he just wanted to stay home. We barely hung out for the last 2 months because his family was visiting and they didn't want to meet me.\n\nI can understand that too, mostly.\n\nBut he never even called me to ask about the hospital or to see if I'm okay. He didn't call me until the end of the night when I had to ask if he could just call briefly to say good night. He said only if it's just to say good night and not long.\n\nI asked him to call me today and he ignored my question. I asked again a few hours later after saying he should have called when I had to go to the hospital and he got super annoyed and mad at me for asking over and over to call me (he ignored me the first time so I asked a few hours later).\n\nHe never called me all day and he said he would have free time to talk to me more this weekend. He just spent all day watching YouTube videos.\n\nHe has never come to the hospital when I have gone. And never comes over or calls after.\n\nI know he probably doesn't care about me, and nothing I do will change that. But I love him and don't want to break up.\n\nAm I expecting too much? AITA for asking him to come to the hospital? And asking him to call me more than once when he didn't come? Am I too needy? Is it normal to not go to the hospital when your partner goes to emergency?\n\nEdit: removed extra words and typos"}
{"title":"WIBTA if I skim from my nephew's trust fund","selftext":"Throwaway because I don’t want this private info to get back to me or figured out. I already feel horrible and isolated for the way I’m currently thinking and feeling.\n\nMy older brother and SIL died recently. I was very close with him and it’s been taking its toll on me, but I can’t even imagine how it is for my nephew (17). Way back when my brother was a first time father, he came into a chunk of money by investing in the stock market. He wasn’t a finance major or anything in college, but after studying on his own he found a nice side hustle in his own. It at first was just a very beneficial way to provide for his newborn son/my nephew, but as it went on he began to use it to make “his life” better. By that I mean he spent any excess or unnecessary money on his son and wife, but not just them but on the world and society. He was a great man and father and a was very much into philanthropy. He made contribution to charities, volunteered every now and again, would host school events, and before he passed was in the process of setting up a scholarship for the schools in his city. The latter was what he was most proud of in his philanthropy at the moment, but now that he’s gone it would likely not be completed. \n\nHowever, my brother set up an account for this type of event should his son be of age or should be enrolled and planning on attending university. In his death it would go to his wife if his son hadn’t fulfilled one of those criteria, but with her passing I was next to receive ownership. Now I know my brother would want me to and trust me to give this money out to his son once he fulfilled one of the conditions. But I too know my nephew and I know how the excess money spent on and given to him has shaped him. My brother would talk about him, my children/his cousins would tell me about him, and I talk to him because I love him. I know that if he would receive such a large sum of money especially in these hard times it would not lead to a favorable outcome for him or in his father’s memory. \n\nOf course, I’m going to give my nephew this money when he’s one of these things. But WIBTA if I skim some of the money from this account before he receives it to make it more manageable for my nephew but also doing some good with it. WIBTA if I left enough for my nephew to be self-sufficient if he chooses a path away from college or enough for his four years if he does choose to but taking the rest to finalize my brother’s scholarship?"}
{"title":"AITA for doing a little dance and bopping my head while listening to music - it was annoying my GF","selftext":"Before I go on I should mention that I was kind of  (well maybe really) high. Uzi dropped that fire EA deluxe yesterday and it had my boy Nudy on it. I listened to it and it was amazing so I went and listened to some more Young Nudy who's my favourite artist. One particular song was groovy as hell and I was just muttering under my breath \"popping a perc imma animal, flipping yo b\\*tch imma stanimal\" and then I just burst out loud laughing cause wtf is that line? My girlfriend who was sitting next to me (we were at her place and it was my turn to aux) kind of gave me the look like what the hell's wrong with you? I mumbled an apology, I was just so in the zone lmaooooo. I didn't mutter any song lyrics after that but another one came on that was just sooo fire.\n\nI had so much energy so I just got up and did a little dance and started doing a mini head bump. I was having fun lol. Then my gf told me to stop acting like a kid and behave myself. I was surprised because I thought what I was doing was pretty harmless and initially I felt hurt. I left and went for a walk just to clear me head and that's where Im writing this from. was I really being childish? I was just in the zone  :("}
{"title":"WIBTA for agreeing with my partner on their weight?","selftext":"Would I be the a*hole for agreeing with my partner he needs to lose weight? He’s agreed with me that I could look better and I’ve insuated the same, but the thing is I don’t feel comfortable fully agreeing or stating it with him. He doesn’t take criticism well in any kind, even constructive, and I feel like some of the things he needs to hear he can’t. I love him whether he’s 40 or 400 pounds without question, but I’m also getting concerned for his health. His weight is becoming unhealthy and while I think he’s as sexy as the day he was when we met, I’m afraid it’s becoming a bit of a health risk. I say it’s okay over and over because when I imply it’s not it becomes an ordeal of how he isn’t good enough. He will always be good enough but the problem is for how long can he be with his health in question. He stress and depression eats and I understand but any kind of reference to it no matter how gentle seems to make him stress about it and thus stress eat from it more. Am I the a**hole for pushing him to be a bit healthier? Or how can I word it in a way that isn’t a**holish? I just want him to be *able* to live out the lifespan I imagine with him.\n\nEDIT: I’m sorry for the random bolder words, formatting isn’t doing what I want."}
