{"title":"AITA for criticizing my friend's short film and causing him to make drastic changes?","selftext":"We’re (19F&amp;19M) both sophomores at our local college. We met our freshman year in our generic freshman transition to college course and we’ve been friends ever since. This friend who we’ll call Tatum is a film major and in the honors program at our school. Since about a month into this semester Tatum has been telling me about this project he has to do for the honors version of one of his film classes where he had to make a short film but his would be held to a much higher standard than all the other non-honors filmmakers in his class. I would go on to help him out throughout the semester with his idea and film. He came a with a brilliant concept and he actually let me play the main character. He said I had the right look for he was looking for so I felt honored to.\n\nWorking between both our schedules and all his other friends', we filmed his piece from start to end through blood sweat and tears and I thought it all went real well. He thanked us all for our time and effort and went to edit and review the work and told us he’d get back to us. Well today he got back to me and told me since I was the main character he’d like to hear my opinion first. Immediately I joked in my head the movie would be a lot better if there was a lot more me in it. He sent me his file and I watched it and watched it and watched it over and over. It was magnificent. I really believe Tatum is going places after we graduate. It was one thing short of a masterpiece.\n\nThat one thing was me, and it was the exact opposite reason of what I initially thought. There was entirely too much of me. I learned that I can’t act for shit. Most scenes I was in my bewilderment and amateurism shone through and really messed with the tone and atmosphere. There was another girl, Veronica, in the film and trying not to spoil his plot she was a sort of a deuteragonist, and it would probably be better if she and I switched roles. Her character was an artist and I’m a Art History &amp; Criticism major/artist (also the art used in the film is mine) and she was an actual actress and film major so probably better fit for my role. So I told him it was tonally inconsistent at some points because my acting was bad and I should probably take the secondary role. I was met initially with an “Oh”. Hours later I got an “Okay. I know what I’m gonna do. Check the gc in a little bit.”\n\nIn ten minutes or so we get a text in the group chat with his alterations. I got the second role, but that was in addition the original role. Veronica got a completely new role but it was quite a step down from a deuteragonist. She would also still be voiceovering my work as the secondary character. Finally at our conveniences he would like to get us together to reshoot some scenes. Veronica didn't like this and had some choice opinion for both of us but mostly me. I didn’t mean to screw her out of her role, but I also didn’t want to keep my mouth shut and let my friend get any less than he deserved. \n\nSo am I the asshole reddit?"}
{"title":"AITA for telling the bride's family to fuck off when they tried to get the indigenous fishermen to leave the beach of their destination wedding?","selftext":"I am from the Solomon islands and a bunch of New Zealanders were having a destination wedding on New Georgia Island, one of the smaller islands in the Solomon Islands archipelago. Their wedding party was on the beach and a bunch of tribal fishermen in canoes and little clothing, traditional Austronesian clothes and were spear fishing and some were diving and picking up abalone or crabs. They were about 150 or so meters away from the shore and not bothering anyone. These guys are pretty cool, they can hold their breath for sometimes up to 7-8 minutes and there is a member that supposedly can do it for 13, though they rarely do it for more than 5.\n\nAnyways the wedding reception is on the beach and the ocean is the background of where the wedding is. The bride's family is very upset as the fishermen won't leave as they would be in all the photos of the wedding. They had been there for like an hour and were likely to stay for another 3-4. The brides family  (mainly mom, dad and uncle) did not want them in the photos while most people thought they were cool and did want them or simply didn't care. A huge argument erupted when the groom's brother argued with bride's mom calling her a disrespectful bitch for demanding when the natives of this land do when they are guests in a foreign country. The brides uncle took a kayak from the beach without my permission and went over to the fishermen. Only like 2% of the Solomon island's population speaks English but most of the country speaks Pijin as a lingua franca, which is a creole language, basically a mix of English and other languages. English speakers can sort of understand it but its not great and many people here including those fishermen don't speak it. They speak Marovo which I also speak.\n\nThe bride's family basically demanded I go there and tell them in Marovo to go away because I'm ruining her daughters wedding. I said sorry i can't do that this is their land. She said \"THIS IS MY DAUGHTERS WEDDING TELL THEM TO LEAVE ITS MORE IMPORTANT THAN THEIR FISH!\"\n\nI lost my shit at this point and said \"LISTEN YOU DISRESPECTFUL WORTHLESS SACK OF SHIT, THIS IS OUR COUNTRY NOT YOURS AND YOU\"RE A GUEST HERE, LEAVE THE FISHERMEN ALONE, WE\"RE IN THIER LAND. IM NOT GOING TO TAKE YOUR SHIT SO GET OUT OF HERE IF YOU'RE GOING TO DEMAND THIS SHIT FROM ME. FUCK YOU CUNT'\n\nThis draws in a bunch of people and a huge argument erupts and i get away. They eventually calm down and after the wedding the bride's father and mother continue to make rude comments to me about how i should've gotten those stupid fishermen to respect her daughters wedding. Daughter is pissed off at her parents for being so disrespectful to the natives. I got a lot of angry emails as well about that as I was basically the only person who spoke their language and could've gotten them to go away"}
{"title":"AITA for thinking that all the Americans currently on foreign soil should be forced to stay there until this blows over?","selftext":"I will say this. With all of the fear surrounding current events, why in the fuck would anyone allow the idiots wanting to come home from over seas back onto American soil? That just seems fucking idiotic to me. If travel from Europe to the united states has been banned this should include American citizens currently in those countries as they are just as likely to cause damage as European citizens if not more so ( packing themselves into confined space- airports). Fuck them and deny them a return trip until this all blows over, or they test negative. Otherwise they are nothing more than plague bearers- like the rats that carried the plague."}
{"title":"AITA for getting someone suspended from their job?","selftext":"Two weeks ago, I went to Wendy's.\n\nThe kid at the counter tells me that they have no soda whatsoever. None. Not believing that a fast food establishment doesn't have one of their basic staples, I go to the Coke Freestyle machine. Sure enough, all the soda options are grayed out. All of them.\n\nI leave the restaurant and go to the Wendy's next town over, where I get the food and drink I want. Granted, some flavors were unavailable, but that's reasonably expected. As I leave that Wendy's and get back into my car, I call the first Wendy's, asking for the manager (yeah, I know, call me a \"Karen\" idgaf lol).\n\nWhen I got the manager on the phone, I asked her how was it possible for you to have no soda whatsoever.\n\nHer response? \"We ran out of CO2 and only the suppliers know when it's empty.\" I had a feeling that she was full of shit, so I start asking \"Don't you have an extra tank available or a gauge so you know how much is left?\"\n\nAs I was asking that particular question, she hung up on me. So I go to the Wendy's website and contact corporate, telling them of my experience of a manager not having soda and hanging up on me. A manager contacts me the next day stating that other employees in that particular store had witnessed her hanging up on me, and so she was suspended for a week.\n\nI don't think of this as a revenge story, but rather I'm posting this to see if I was in the wrong for overreacting? I know some people will say yes it's just soda, but I think it's a matter of good management. A good manager will say \"I'm sorry for the inconvenience, if you come back we'll give you 5% off your next visit\" or at least \"I'm sorry for the inconvenience\" (since I don't want to give the idea that I'm looking for freebies, which I'm not). \n\nThey DEFINITELY should not hang up on an upset employee. Employees keep the lights on, so that's the last thing you'd want to do.\n\nAITA? Current or Former Wendy's employees, is what she said true? Is there no way for the employees to determine if the store is low on CO2?"}
{"title":"AITA for stealing from my dad, using, and ignoring my dad?","selftext":"For some context for y'all, My dad did many things that were wrong in every way, so my entire mom's side of the family avoided him.\n\nA few years ago my brother was really sad, like sad sad, and mostly because of my dad being mean as hell. Me, being so childish, thought my dad was right and took his side, I said what he wanted to say, and done what he wanted to do.\n\nMy dad did really bad stuff, my brother would get scared of him and he would break friendships my brother made, told him that whatever happen is not true, then told him all his online friends are real but either bots or grown men. Sometimes he would tell people who are glad LGBT+ how wrong they are, overall, he was just straight up rude.\n\nThen, after hearing my mom complain about dad a few years after the whole ordeal, I started to learn how wrong my father was and how he manipulated me to hate my own brother. I started avoiding my dad, I despise going to his house when it's his time. Later, my brother moved out and stayed at one of his friend's houses, of course, I was sad but he needed to get out of this hell house, he is in a better place, my brother and I started to become actual siblings for once, and finally began to love him.\n\nThat was ages ago, now my dad would provide anything for me but he have not change from all those years ago, but he would give me food, ask for anything when he heads out, and ask if I were to come. Everything was still the same after all that but I changed, I always said no, and made it seem like I was uncertain and feel sorry that I am unable to go out with him. I would only ask him to make me a small dinner, so I would just eat it and leave. I would lock myself in my room, sleep early, and only get up and leave it if I'm hungry, my friend wanna hang out at their house or it's my mom's time to have her time with me.\n\nThen, he would say that only to use one bathroom light because the other has a loud fan and it uses a lot of electricity, so I use both lights and steal my dad's money to help my poor brother with college, find a job, and help him with what he wanted to do, and even use it to save for my top surgery. But my father is starting to catch on, reminding me of the whole light thing, and guilt trips me and our family to let us remember that he is my father, and he wanted to be a father figure.\n\nAITA for stealing from my dad, using, and ignoring my dad?"}
{"title":"AITA For getting mad at my ex for hanging out with her ex while she's home alone?","selftext":"So a little bit of background knowledge. I've been with this girl for a while now and she makes me really happy and I like being with her. She just likes to talk to her ex a lot and talk to other guys and I've explained on multiple occasions how it makes me uncomfortable that she still talks to her ex. Well today I was just hanging out finishing up a research paper when she calls me saying how she wants to talk. Now she does this a lot and usually I enjoy talking to her but a few minutes into the call I heard the voice of another guy and I knew it wasn't anyone in her family so I asked and she said it was a friend of hers (it was her ex) so I asked what he was doing at her house and she said she was home alone and bored. Now I may seem like I overreacted but I instantly told her to kick him out and if she didn't then it would be over between us because I know her and her ex have a history of still liking each other when she reassures me she doesn't. So I tell her to kick him out and she does but lately she seems like she's been distancing herself from me more and more. Am I the asshole for getting mad without asking for any other info?"}
{"title":"AITA for telling a girl on my language learning app that she's pretty, since I have a girlfriend?","selftext":"I'd been chatting with a Chinese girl on an app I have occassionally, mostly English since my Chinese is still pretty bad but I use words and phrases when it's possible. And she also asked me stuff like what kind of girl I liked and if I'd ever been in love with a Chinese girl, and she mentioned that she'd posted more pictures on her profile and wanted my opinion of them.\n\nSo I told her after looking at them that they were really nice pictures and such. Then she asked me if I thought she looked good in those pictures. So I wrote her saying that I thought she looked very pretty in them, which is true, since she's a cute girl. \n\nShe writes me back saying how she's happy that I think so and says she was worried I thought she was ugly because I hadn't said anything about it at first and that it had made her sad. So I got a notification for that message on my phone which my girlfriend saw and now she acts like I was flirting with this girl and says that I should have told her about being taken. Even though I never flirted with her and also what's the point of telling her since she pretty much lives on the other side of the globe? I think bringing it up without reason would be more awkward, really.\n\nAnyway, am I the asshole here? I think my girlfriend is overreacting a bit and I was really just being friendly when she asked me about it."}
{"title":"AITA for precautiosly blocking people on my social media accounts?","selftext":"This is may sound like a weird problem, but let me explain.\n\nI was bullied at school for quite some years. Ultimately I changed schools and this shit stopped at least at school. Unfortunately it continued for a bit since my bullies and I lived in the same village (rural area, 400 people living there, so there's no way to avoid each other completely).\n\nShortly before I moved away about one and a half years ago I got Instagram. Ever since then I have blocked each and every person's account of people who actively bullied me or occasionally joined in to stay cool, even if they hadn't sent me a follower request (my account is private), just because we never officially \"cleared things up\" and I'm kind of terrified of them starting some kind of cyber bullying and I also don't feel safe when I think about them knowing details about my life.\n\nBut recently I started to wonder if I'm overreacting. It has been years since I changed schools, we haven't really spoken since and maybe I should forgive them and unblock them so if they want to see what became of me they can.\n\nI really don't know, AITA for blocking them as a precaution?"}
{"title":"AITA for asking for my old games console back?","selftext":"I’ll keep it short. TL:DR at the bottom. \n\nWhen I left home to travel and work a few years back, I sold my dad my PS4 for super cheap. I needed the money at the time and he was happy to get a really cheap 2nd PS4, as he could now play games side by side with his partner, and support his son a bit financially. I also left him my 4K TV to play it on, absolutely no charge. \n\nFast forward to now, and I’m back home from travelling and obviously have to stay inside for a couple weeks. I’m bored out of my mind, obviously, so I asked my dad if I could borrow back his PS4 and my TV temporarily so I have something enjoyable to do at the end of the day when my work is finished. \n\nHe said sorry, he plays games on both consoles. I said surely you don’t need two, you can handle playing only one for two weeks tops. He also has an XBOX One, so three consoles total. Still a hard no. \n\nI’m really pissed off and wondering if if I’m right in thinking he’s being a major asshole? Or AITA?\n\nTL:DR - Sold my dad my PS4 and gave him my TV for free a few years back. Asked for them back temporarily during two weeks isolation back home and he gave me a hard no."}
{"title":"AITA For rejecting my friends advice on how to solve the rumours about me and my GF?","selftext":"Hi, also, just wanna make it clear that I’m female, and bi-sexual and have a GF, so on top of these rumours there’s also some homophobic business but we both have eachother so that part doesn’t bother us. TL;DR at the end \n\nOnto the story \nWhile I was in a class period today a friend came up to me and said “have you heard the rumours about you and S/O??” I was confused and like, no what’s happened?,  aparantley a group of people have started up rumours me and her do ‘sexual things to eachother’ in class, we do not. I guess I get the idea of how it came to be, we Always love cuddling and being close to eachother and giving eachother secret kisses and all, but never anything sexual in public. Anyhow, I was pretty bummed about it seeing as I didn’t want me or my GF to have any sort of reputation or get in trouble, so I spoke to my friend about it, let’s call her becca (not real name) the conversation Went as such \n\nBecca: Hey op, what’s up? You look down \n \nMe: well, some people have started rumours about me and S/O, aparantley they think we do sexual stuff together because we always sit near eachother in class or cuddle \n\nBecca: well, I can see where there coming from OP, you always do cuddle up together and fondle eachother, so it’s kinda your fault, your making everyone else uncomfortable because of the way your acting with eachother, and if you want the rumours to stop, you should stop being so touchy with eachother \n\nWell I was pissed, I didn’t see how this was our fault because people had got the wrong idea just because we like to cuddle, we’re just cuddly people, and we never get to see eachother because of her strict, slightly homophobic parents, so I was even more pissed. I dismissed her advice with cold “I see.” And went quiet on her, she didn’t like this and told me “if you don’t want me to help you you don’t have to be such a bitch about it”.\n We didn’t speak much for the rest of the day, and I’ve been having mixed feelings about the convo, what do you think reddit?should I have listened?  AITA? \n\nTL;DR: my Friend told me it was my fault for being affectionate with my GF because (I’m her opinion) that’s why some nasty rumours started and We’re making people Uncomfortable"}
{"title":"AITAH for being upset for something that someone called me a year ago","selftext":"So I recently came out as Bisexual to my best friend and my brother no one else knows. When I came out to my brother I brought something up that really pissed me off, some time last year he called me a f***t ( I don’t even want to type that word) this was before I was out and during me figuring out my sexuality, anyway so after I bring it up I tell him how it made me feel and he just goes off on me and tells me to forget it. A little while later I tell him that I’m terrified to come out to our parents because I don’t know they feel about the LGBTQ+ community and he told me “not my life not my problem”. I haven’t really talked to him sense then Am I the butt hole for bringing something up like that from a year ago. I mean I still feel horrible about what he said to me just thinking about it now is bringing me to tears thinking he’s not supporting me I mean he has nothing against LGBTQ+ but anyway if you read this sorry for any bad grammar and for the rant I just really needed to get this off my chest."}
{"title":"WIBTA for telling my brother to get a hotel?","selftext":"So my brother and his wife&amp;baby are coming to town. My nephew is 3 months old and the cutest little guy in the world and they're coming to introduce him to everyone here. My brother lives across the country and the rest of the family lives here where I live so we haven't actually met him yet! (Except for my Mom who flew out when he was born). \n\nMy parents have a tiny 1 bedroom apartment (they are always traveling so they downsized by a lot when everyone left home) and my siblings all have roommates so my house is really the only option for my brother to stay at because I have a 2 bedroom apartment with a spare room with just myself and my Fiance. In ANY other normal circumstances they could stay with me in a heartbeat and do.\n\nI just had a pretty major jaw surgery and recovery has been rough. I'm already dealing with frustration with my jaw being constantly in pain and I'm pretty concerned that the baby staying with me and crying is going to exacerbate my inability to sleep, migraines, and all around small threshold for noise recently. \n\nI know that the new baby has put financial strain on my brother and they just bought a house so I really don't want to put them in a bad spot. Should I just suck it up for the week? I care about them a lot and I'm not sure if I should just eat the week of pain to be with my nephew or if I should let them know that it's not a great time and my pain just won't allow for visitors right now. It is kind of the unspoken agreement that they would stay here if they came so I do have to tell him if he can't stay here, but the guilt of thinking about potentially putting financial strain on them is eating at me. I am so tired of this pain though and I honestly don't think I could handle a screaming baby right now even though I already love him to pieces. Thoughts?\n\nEdit to add: I'm having a phone call with my brother tonight and I will tell him then if I do decide they can't stay here so that they aren't blindsided. Just wanted to clarify that."}
{"title":"AITA For Not Letting Another Dog Get Busy With Mine?","selftext":"I feel like I'm in the Twilight Zone here so getting some outside perspective on this one. A couple days ago I was at a birthday party for a family member. My wife and I decided to bring our 4 month old puppy since the family had not seen her yet (after receiving permission from the owner of the home of course) and my Aunt brought her dog. I figured this would be a great way for my pup (4 month old female) to get some socialization with another dog, like my aunt's (9 year old male).\n\nAlmost instantly he starts going after her and I'm monitoring, and at first it was normal stuff. My pup was trying to jump on him and he wasn't letting her. Some typical doggie \"figuring out the pecking order\" type stuff. But it all devolved pretty quick. My aunt's dog starts humping the air a lot and at first it was kind of funny, like this dog had no idea what he was doing. Me and my uncle laughed it off.\n\nBut as it continued, and I was monitoring the whole time, they started running around and my dog looked more and more uncomfortable. Her tail went between her legs and she ran over by me a lot but this whole story all comes to this point, when my aunt's dog chased mine down, pinned her down and actually successfully...um...started having a lot of fun real quick. My pup was barking and nipping and trying to get up but was pinned down. I freaked out, ran over, and grabbed my aunt's dog and pulled him off of mine.\n\nFor the rest of the night I kept my pup separated and under constant supervision and to be honest, I feel absolutely horrible. I feel like my puppy depends on me for protection and I failed her. But here's where I am asking for judgement. Because my aunt, the owner of the dog, said I was completely overreacting and that \"they just dogs who cares?\" She said I was being a bit of an asshole about it all. This got me thinking, am I in the wrong? I mean, my logic is she's only 4 months old and she looked like she really didn't want it at all.\n\nSo, Reddit, AITA for putting an end to the situation?"}
{"title":"WIBTA for getting someone to take over a lease before I move in?","selftext":"I am in college, I am moving in with a girl next year into an apartment off campus. Well, I was going to. I just got the news that I am a strong candidate for the Disney College Program in Orlando for the August-January cycle. All I have left is the phone interview, and if I get in, I am not going to give the opportunity up. This is something I have wanted to do since high school.\n\nI feel bad. I could realistically find someone to take over my half of the lease no problem, but would I be an asshole for it? I signed the papers and put the down payment in. I would feel bad for dipping without hardly knowing the girl."}
{"title":"AITA For laughing at my atheist friend","selftext":"Any way I am a Hindu and my friend lets call her \"she\" is an atheist. Any way she makes fun of religions and my religion calling me a dumb person for following a religion and not being woke. Any way she was bragging about the religious holidays she celebrated like Diwali and Hanukkah.  I just started laughing at her and saying wow you celebrate religious holidays with your family that are religious , make fun of the same religions and then say you are atheist. I found that she celebrates religious holidays when she is an atheist Ironic. Any way she was called me dumb bigot and not woke and left the room crying calling me a dumb Hindu. I believe atheist should not be allowed to celebrate religious holidays If they make fun of the religion and don't know the meaning behind the holiday."}
{"title":"AITA for not wanting my family to get a cat because I have allergies?","selftext":"My sister recently informed me that she's going to get a cat despite me having an allergy. The last time I held my friend's cat for about 15 minutes I developed an itch on my arm that turned pink. I was also sneezing, stuffy-nosed, and felt drowsy overall. I haven't been around cats most of my life but this reaction leads me to believe I certainly have a cat allergy. I've been around dogs and don't have an allergy there. However getting a dog is not an option because my family is Muslim and don't keep dogs in the house. \n\nI have said many times that having a cat would threaten my comfort due to allergies but this was shrugged off as \"well, it will be with/sleep with me\" and \"I'm suffering not having one/I want to be selfish\". Am I being the selfish one for not wanting this to happen?\n\nMy room is right across from my sister's and I know I'm going to want to hold and be around the cat because I love animals so this is going to be difficult for me. Our home has 3 levels with an empty basement suite but I would feel bad about restricting cat and family to one level to be around it. Does anyone have suggestions?"}
{"title":"AITA for explaining what jacking off is?","selftext":"Last week my oldest sister dropped off her 13 year old son off at my place so I can watch him. To tell explain: my sister is born Again Christian who is anti porn and sex, thinks boys and girls should keep their crotches one bible space apart, and of course, she hasn’t even told her kids what sex is. So my nephew no idea what jacking off is and has never seen a naked woman. Like damn. So he comes over and we watch some tv. At one point a character mentions jacking off, he asks me what that is I straight up explain what it is. So his sister picks him up and everything is good until next week I get an angry call from my sister. She said she caught him jacking off in the kitchen and she looked at his internet history and saw he watched so much porn. She immediately blamed me because we never saw eye to eye on her religion but I love her kids, especially her son and I feel bad he’s growing up like a 13th century monk. So I was like “I just told him what is was, he would be jacking off so much if you raised him like a normal kid” but she Just screeched and hung up.\n\nWas I the asshole?"}
{"title":"AITA for wanting to use the dishwasher?","selftext":"Wanting to use the dishwasher but my mother doesn't want to for the following reasons:  \n\\- only 2 people in the house hold  \n\\- wastes electricity  \n\\- wastes water  \n\\- hard to dry out  \n\\- not that many dishes to wash\n\nI've propose that we run it one a week but she doesn't want to use it at all.\n\nAITA?"}
{"title":"WIBTA if I tell my flatmate to stop bringing his friends over?","selftext":"I (21F) live with my partner(23M) in a flat he owns in the city. We have a spare room which we rent out to our friend(19M). Living with him has his rough patches, such as sometimes he will eat our food, use our personal items, play music obnoxiously loud etc. I try have the benefit of the doubt with him as he’s young and works minimum wage, I was once in his position. \n\nOver the last few months, he has started bringing his friends over, playing music loud, then going out to smoke weed. I don’t care he smokes, he can do what he wants, but the way his friends basically are in and out of the flat makes it seem like he’s using the space as a hotspot for smoking. Although I don’t care if he smokes, the smell of weed in the flat is grim. We also have two cats so I’m dubious that’s going to be good for their health. My partner is also very anti-drug. We have been lenient but the smell is getting quite unbearable, and he’s using more of my personal items to cover the smell of weed (and not replacing any of it when he uses it all.) \n\nI’m also concerned as I don’t know his friends, and all my belongings are in the flat. Some of his friends are dealers, criminals etc. I’m not making any assumptions that they are to steal any of my/partners belongings, however I have raging anxiety and my home is my safe space so I feel on edge having many random people come into my home. \n\nI don’t want to tell him he can’t have friends over, he pays rent so he has every right to have whoever he wants over, but I don’t want my home being used as a social gathering of loud music and drugs. He also has a girlfriend who practically bangs the door down to come in as he always falls asleep and doesn’t wake up to her calls. \n\nWIBTA if I confront him and tell him how uncomfortable I feel with his friends coming over all the time?"}
{"title":"AITA for not wanting to rent a house with my boyfriend?","selftext":"In 2016 my mom passed away and she was divorced. I always received allowence from my dad and that money ive been using to rent a room in my aunts house. Since im almost finishing university i wanna save the most money i can to use in the future.(buy a house, have pets etc). So i wanna move from my aunts house to a cheaper rent.\nThat being said Me [21F] and my bf [21M] have been dating for almost a year now and he spends most of the time with me in my aunts house (where i rent a room). We are from very different social classes and our dating has been kinda rough since the beggining, but i love him very much. The problem is he basically lives with me: when i go out he stays at my house and even my aunt is getting a little stressed about this. He doesnt have a job because he is on the last semester of his course and has to get a mandatory internship that is not paid but he says thats the only reason why he is not looking for another job and that when we move he will help as soon as possible. But i pay for everything that we do and even tho he has shared that he feels ashamed sometimes because of this ive told him its alright... but sometimes that does bother me a little. He lives with his grandparents and i know the money he gets comes from there and its hard for me to ask for it cuz i know his grandma needs it.\nAlso i feel embarassed but i have my pc since 2012 and i spent most my time at home in it: to study and to have fun, but these days i feel like when he is awake i cant do the things u used to because he is using my pc.\nSo the point is I really have to move somewhere else but i cant do it whithout him! He is always around and these days i can barely talk to my friends in private cuz seems like hes glued to me. But he doent have the means to really help keep a household functioning (bills, etc) and i am currently not employeed also so the only money income is my allowence, wich will stop when i finish university.\nAlso i have two other female friends who are looking for someone to share the rent and they invited me if i wanted to share but my bf thinks its not a good idea. While i agree with him that i would prefer to live by myself i know its a lot more money than sharing. Plus ive never lived with someone else besides my relatives and i always liked the idea of living with friends.\nhow do i conveey this whole situation to him without making it sound like he is a burden?\n\nSorry if its too long."}
{"title":"WIBTA reporting this family to child services?","selftext":"We have neighbors who let their toddler roam unattended for hours on end. He will sometimes walk out of their open door and sit down to literally play in traffic. I fear someone will accidentally kill this kid with their car if I don't speak up. \n\nI'm worried about their kid ending up dead whether it's me or someone else. As it stands right now, there are no adults in that home advocating for the safety and well-being of this child.\n\nMy biggest problem is they let their unattended baby roam the parking lot for hours at a time. They'll leave their slider open and basically kick the kid outside with some toys (or he will just casually stroll out). He hasn't been walking for long and he's not verbal so he must not be very old, e.g. still mostly looks like a bobblehead.\n\nHe will weave in and out of cars actively parking or leaving, almost like he's actively trying to get hit! Or, will walk around and play with dangerous sharp shit or garbage, or will climb 2-4 story stairs and sit at the top. There is just no sense of danger registering.\n\nIf he goes 10 feet one way he's in a parking lot, 10 feet another and he's in a creek, and 10 feet another direction he's on a main road. 10 feet behind them, and he falls down stairs!\n\nThen there's the used 8 ball bags of white powder outside their car door, and I can't help but think this poor child is gonna end up dead from their neglect.\n\nWIBTA contacting child protective services for the safety and welfare of this child?"}
{"title":"AITA Sister vs Best friend","selftext":"My best friend has a good job that she got a promotion for a while ago so has extra money to spend after she and her boyfriend pay their bills. She likes to spend this extra money on me and herself and has told me constantly that she doesn't mind as stuff we get is usually on sale and she has coupons for certain stores at the mall. This brings up a problem with my sister as she feels that my best friend has spent too much money on me and thinks that my best friend should stop doing this until I can pay for stuff myself. This is a problem as I've only have enough for bills, food and paying for our mom's stay at the hospital ( she hasn't been feeling well and has been hurting for a little while). My best friend doesn't think this is fair as it's not my sister's money. Am I the asshole? \n\nEdit: Best friend and her boyfriend do live together and have for over a year."}
{"title":"AITA for telling my girlfriend's roommate that its really cringy that she steals other people's laundry?","selftext":"I was over at my girlfriend's place and her roommate comes over and slams the door open and pulls out a bra and says \"look who just found this amazing victoria's secret bra. Another great find from the laundromat.\" I guess she wasn't expecting me to be in there so she's like wtf is he doing here. I said \"why do you do this, why are you stealing people's clothes thats not cool bro?\"\n\nShe then tells me to stfu and mind my own business. 3 hours later she posts the bra, some dresses and other clothes on Facebook. It was titled \"look at my brand new clothes, they tots look fabs\" I responded to the post and commented \"Its  fucking cringe that you steal clothes from the laundromat and then brag about your clothes online.\" \n\nA bunch of people commented lol and her mom saw it and apparently got really pissed wit her and they had a huge discussion. Her family is pretty fucking pissed about it. Apparently she started crying after this whole thing and accused me of bullying her. She blocked me on Facebook"}
{"title":"AITA for cutting my father out of my life even though he started trying to help me","selftext":"This is my first post on this subreddit and I'm on mobile so sorry for the formatting.\nAm I the asshole because my father has been relatively absent in my life growing up.  Though now I am older and still live with both of my parents I currently have an addiction, I sought help with this to try to make him happier that im taking a step to stop this addiction with both conventional and unconventional methods.\nBut as of the day posting this I have decided I shall not take any help he has decided to just now begin giving.  He was absent in my childhood always working and such, I decided to give him a chance and now I am regretting it heavily.  He has began turning off wifi to my rooms and devices as \"incentives to quit\" and I grew more and more disdain towards him.  With him just now trying to take steps I am refusing it with all my might but he kept trying until today when we got into a screaming match and I told him \"stay out of my way and my life\" granted there be more swearing in there but I can't help but feel like an ass for doing this but it being later in my life and him just now taking intrest in me makes me feel like he doesn't deserve the chance.\nAm I the Asshole."}
{"title":"AITA for telling her to not contact my doctor?","selftext":"I’m 22 years old and I have a cardiologist. My mom told me she email my cardiologist about something she was curious about and I told her that she should 1) not being doing it through email since she doesn’t have a portal account 2) it’s not her doctor and I’ve been 18+ for a while now. \n\nShe said she was gonna do it anyway. She needs to ask her own doctor about her concerns about going outside in the conditions currently. I told her she is over stepping boundaries and needs to not contact my doctor.\n\nEdit: she is only asking about if it’s okay to have people over and stuff like that, but if it’s so general then she shouldn’t be asking my cardiologist. She should be asking her own doctor. She’s being weird. \n\nMy doctor is also not her doctor and never was. \n\nAITA?"}
